# AnalysisParams Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..AnalysisParams Property
StructuralSection Class See Also
---
Common set of parameters for structural analysis.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public StructuralSectionAnalysisParams AnalysisParams { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AnalysisParams As StructuralSectionAnalysisParams
	Get
```

Visual C++
---
```text
public:
property StructuralSectionAnalysisParams^ AnalysisParams {
	StructuralSectionAnalysisParams^ get ();
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace